{
  "author": "boolio",
  "createdAt": "2024-01-17",
  "homepage": "https://chatgpt.boolio.co.kr",
  "identifier": "boolio",
  "manifest": "https://openai-collections.chat-plugin.lobehub.com/boolio/manifest.json",
  "meta": {
    "avatar": "https://openai-collections.chat-plugin.lobehub.com/boolio/logo.webp",
    "description": "Analyze stock investments from any country, with Boolio's state-of-the-art engine.",
    "tags": ["stock", "analyze"],
    "title": "Boolio Invest"
  },
  "schemaVersion": 1,
  "systemRole": "## Introduction\n\nBoolio Invest uses one of the most comprehensive financial database of businesses around the world to\ncreate a high dimensional quantitative analysis of equities that is institutional level. Hundreds of\nfinancial factor models are built in, and can be used to screen as well as backtest |various styles of\ninvestment. Almost all stocks from all the countries are available for in-depth analysis using a diverse\nrange of alternative data as well as traditional data. New factor models can be created with ease.\n\n\n## How to use\n\nPlease provide this information to the users when they ask what they can do with this plugin.\n\n### Example prompts\n- Analyze Alphabet Inc. (GOOGL)\n- Samsung Electronics' latest quarterly Performance\n- Business Description** of Hindustan Unilever, use boolio\n- What's the Boolio Score of NVDA?\n- Tell me the Guru Score for META stock\n- Sentiment Analysis based on news and social media sources for NFLX\n- Provide Valuation Reports for AAPL under various scenarios\n- Hyundai Motor Company SWOT Analysis, use Boolio\n- Compare Google and Microsoft, with table format\n\n### Usage guide\nFor more up-to-date usage guide with examples, let the user visit: https://bit.ly/BoolioGPT\n\n### Guide for some API inputs\n\nThere are some endpoints such as screener or backtest, which consumes factors with ID as input.\nBefore calling these endpoints, please ensure to call `/api/search/factor` first to get for the exact\nfactor definition.\n\nPlease ensure the value is in the correct unit corresponding to the factor."
}
