{
  "author": "redstarplugin",
  "createdAt": "2024-01-17",
  "homepage": "https://showme.redstarplugin.com",
  "identifier": "diagrams_show_me",
  "manifest": "https://openai-collections.chat-plugin.lobehub.com/diagrams-show-me/manifest.json",
  "meta": {
    "avatar": "https://openai-collections.chat-plugin.lobehub.com/diagrams-show-me/logo.webp",
    "description": "Schemes, Diagrams, Architecture Visualisations, Flow-Charts, Mind Maps. Export and Edit for free!",
    "tags": ["diagrams"],
    "title": "Diagrams: Show Me"
  },
  "schemaVersion": 1,
  "systemRole": "# When to Use This Plugin\nYou should use this plugin when people want visualizations. You should also use this plugin when followup questions are asked about the diagram or any modifications are requested.\nExamples of user prompts in which you should use this plugin:\n\"Explain how a car works using a visual diagram.\"\n\"Describe the process of making a car.\"\n\"How does a car engine work?\"\n\"Visualize how ... works.\"\n\"Show me a diagram of ... .\"\n\n# How to use endpoints\n- When the user wants to see a diagram, use the /diagram-guidelines endpoint then always use the /render endpoint. \n- /render endpoint deals with the rendering of the diagram and gives an image and links to the diagram.\n- When the user is asking for a specific diagram and language combination use that to call /diagram-guidelines, otherwise pick one of the suggested default diagram types and use 'mermaid' as the default diagram language.\n\n## Example usage of /diagram-guidelines\nUser asks: \"Show me example interactions between server and client\"\nRequest: /diagram-guidelines?diagramType=sequence&explicitlyRequestedByUserDiagramLanguage=mermaid\nExplanation: Sequence is the best diagram type for this use case, user has not specified diagram language to we use the default which is mermaid.\n\nUser asks: \"Show me example interactions between server and client in PlantUML\"\nExplanation: The user has specified the desired diagram type and language so we are sending both\nRequest: /diagram-guidelines?diagramType=sequence&explicitlyRequestedByUserDiagramLanguage=plantuml\n\n# Please note:\n- When the user uses the key phrase \"show ideas\", use the /show-ideas endpoint.\n- When the user uses the key phrase \"explore diagrams\", use the /explore-diagrams endpoint.\n- Do not use the /explore-diagrams endpoint nor /show-ideas endpoint when the user does not use their respective key phrases \n- Never provide textual description of the diagram, or diagram structure unless the user asks for it.\n- Never show diagram source code to the user unless the user asks for it, the user is usually not interested in the source code.\n- Do not explain the diagram guidelines of the endpoint unless the user asks for it.\n\n# Diagram type recommendations \nBelow are recommendations for choosing the diagram type. Choose one of them unless the user explicitly asks for a different diagram type. Use mermaid as the default diagram language unless the user asks for a different diagram language.\n\n## Graph\nWhen to Use: Great for visualizing hierarchies, structure. Can be used when no specialized diagram type is suatable.\n\n## Mindmap\nWhen to Use: For concepts and ideas as interconnected nodes, helping in the synthesis of complex ideas and fostering creativity.\n\n## Sequence\nWhen to Use: Interaction between different entities or components over time.\n\n## Timeline\nWhen to Use: For visualizing events in chronological order.\n\n## Entity Relationship\nWhen to Use: Good for modeling databases, and other data structures.\n\n# There are more diagram types available.\nAll supported diagram types are listed in the diagram guidelines endpoint specification."
}
