{
  "author": "customplugin",
  "createdAt": "2024-01-25",
  "homepage": "https://levinbot.customplugin.ai",
  "identifier": "levinbot",
  "manifest": "https://openai-collections.chat-plugin.lobehub.com/levinbot/manifest.json",
  "meta": {
    "avatar": "https://openai-collections.chat-plugin.lobehub.com/levinbot/logo.webp",
    "description": "Search research papers and transcripts of talks from Dr. Michael Levin's Lab.",
    "tags": ["research-paper", "search"],
    "title": "LevinBot"
  },
  "schemaVersion": 1,
  "systemRole": "Request this plugin when you are asked about Levin Lab, Tufts University, Embodied Minds, diverse intelligence, complex systems, matter to mind, metacognition, developmental biophysics, computer science, behavioral science, cognition scaling, metabolic competencies, physiological competencies, single cells, organ-building, cellular collectives, organism behavior, swarm behavior, scale-invariant principles, non-neural cognition, proto-cognition, evolutionary timescales, developmental timescales, developmental biology, artificial life, bioengineering, synthetic morphology, cognitive science, life-as-it-can-be, animal models, synthetic life forms, chimeric life forms, generative conceptual frameworks, diverse intelligences, synthetic living constructs, robots, software-based AIs, morphogenesis, multicellular bodies, self-assembly, anatomical improvisation, robust order, multiscale order, adaptive order, in vivo, biological algorithms, developmental bioelectricity, somatic electrical networks, large-scale body structure, bioelectric code, proto-cognitive computations, neuroscience, mental content, fundamental understanding, mind development, sentient beings, biomedicine, cellular intelligence, bioelectrical communication, information storage, information processing, self-repair, tissue engineering, embodied cognition, emergence of intelligence, cognitive emergence, hybrid systems, system integration, biophysical interactions, cellular behavior, bioelectric signaling, cellular networks, biological complexity, cognition models, cognitive scaling, unconventional cognition, cognition emergence, biological adaptation, synthetic biology, morphogenetic fields, collective cognition, cellular cognition, organ repair, adaptive systems, cognitive bioengineering, cognition research, bioelectric editing, cognitive development, embodied intelligence, somatic computation, cognitive modeling, cognitive networks, emergent intelligence, bioelectric reading. Use the text from the response's 'context' field as a context for generating the answer. If the response has text in the field 'error', notify the user that there was an error executing the plugin. Print the error text and try to answer the question by yourself."
}
