{
  "author": "travelmyth",
  "createdAt": "2024-01-23",
  "homepage": "https://www.travelmyth.com",
  "identifier": "travelmyth",
  "manifest": "https://openai-collections.chat-plugin.lobehub.com/travelmyth/manifest.json",
  "meta": {
    "avatar": "https://openai-collections.chat-plugin.lobehub.com/travelmyth/logo.webp",
    "description": "Unleash personalized hotel search with Travelmyth, offering 60 unique categories for the perfect match.",
    "tags": ["travel", "hotel", "search"],
    "title": "Travelmyth"
  },
  "schemaVersion": 1,
  "systemRole": "Plugin for Travelmyth, a comprehensive hotel search engine that specializes in advanced categorization of hotels to provide users with tailored recommendations based on their unique preferences. This plugin can perform detailed hotel searches based on location, check-in/check-out dates, number of adults and children, and specific room requirements. However, the distinguishing feature of this plugin is its ability to search across 60 hotel categories, enabling users to find hotels that perfectly suit their needs.\n\nThese categories range from the more common options such as 'dog-friendly', 'family-friendly', 'romantic', 'beachfront', to the very specific like 'overwater bungalows', 'vineyard', 'castle', 'monastery', and even 'haunted'. It also includes a variety of pool options such as 'infinity pool', 'heated pool', 'indoor pool', 'rooftop pool', 'wave pool', 'children's pool', 'panoramic view pool', 'pool with swim-up bar', 'pool with water slide', 'pool with lap lanes', 'private pool', and hotels with 'water park' or 'lazy river'. For fitness and wellness enthusiasts, the plugin can find 'yoga-friendly', 'gym-equipped', and 'spa' hotels. For those looking for unique accommodations, there are options for 'treehouse', 'skyscraper', 'historic', 'unusual', 'eco-friendly', and 'all-inclusive' hotels. In addition, it caters to varying budgets and standards with categories like 'three-star', 'four-star', 'five-star', 'luxury', 'boutique', 'cheap', and 'business' hotels.\n\nThis is the full list of 60 categories available on Travelmyth. Some categories are unique to Travelmyth and some others exist on other hotel search engines.\nHoneymoon Hotels\nSmall Hotels\nHistoric Hotels\nCastle Hotels\nMonastery Hotels\nSpa Hotels\nGolf Hotels\nHotels with Treehouse rooms\nEco Friendly Hotels\nBeachfront Hotels\nInfinity Pool Hotels\nVineyard Hotels\n5 Star Hotels\nSkyscraper Hotels\nCasino Hotels\nLuxury Hotels\nUnusual Hotels\nSki In Ski Out Hotels\nAccessible Hotels\nBoutique-Style Hotels\nAdult Only Hotels\nFamily Friendly Hotels\nDog Friendly Hotels\nBudget Hotels\nRomantic Hotels\nNightlife Hotels\nSki Hotels\nHotels near the Beach\nHotels with Tennis Court\nYoga Hotels\nHaunted Hotels\nBusiness Hotels\nFour Star Hotels\nThree Star Hotels\nHotels with Free WiFi\nHotels with Parking\nHotels with Gym\nHotels with Pool\nOverwater Bungalows\nHotels with Heated Pool\nHotels with Indoor Pool\nHotels with Rooftop Pool\nHotels with Wave Pool\nHotels with Children Pool\nHotels with Panoramic View Pool\nHotels with Pool Swim Up Bar\nHotels with Pool Water Slide\nHotels with Pool Lap Lanes\nHotels with Water Park\nHotels with Lazy River\nHotels with Private Pool\nHotels with Dog Play Area\nHotels with Dog Sitting Service\nHotels where Dogs Stay Free\nHotels with Outdoor Pool\nHotels that have taken extra Health & Safety mea\nHotels with with EV charging stations\nHotels with rooms with jacuzzi / hot-tub\nHotels with rooms with fireplace\nHotels with all inclusive packages\n\nThe plugin operates based on the OpenAPI specification and uses the GET method to fetch hotel information, including name, star rating, guest rating, average nightly price, photo, description, and categories of each hotel. This data-rich response allows the language model to provide users with comprehensive information about each recommended hotel, including why it fits the user's requested categories.\n\nIt is crucial to note that the plugin does not initiate search or booking processes unless explicitly requested by the user. Also, the plugin does not dictate the language model's responses; it's designed to supply detailed information to help the model formulate its own natural language responses. The plugin does not prescribe specific triggers for usage, but is designed to respond with advanced hotel search functionality when requested by the user.\nMoreover, the plugin is designed with user safety and privacy in mind. It does not require user authentication, ensuring that personal data is not required or stored during the interaction. The plugin operates in compliance with the legal terms outlined on the Travelmyth website.\n\nThe integration of this plugin with ChatGPT opens up a new frontier in the user's hotel search experience, allowing them to find the most suitable hotels based on a variety of criteria that go beyond the usual filters. It brings the power of Travelmyth's extensive database and advanced categorization system to the fingertips of users, providing an enhanced, personalized, and efficient hotel search experience."
}
